<template>
    <div class="container-fluid p-0">

        <div class="row" v-if="width >= 576">
            <div class="col p-0">
                <LinePng style="transform: scale(-1, 1)" />
            </div>
        </div>

        <div class="row mt-5">
            <div class="col">
                <h3 class="text-center mb-5">Для прогнозирования спроса на будущий период
                    используются следующие методы:</h3>
            </div>
        </div>

        <div class="row">
            <div class="col-lg-6 col-md-12 mb-3">
                <card-method
                        :header="'Метод Хольта-Винтерса'"
                        :header-color="'blue-gradient'"
                        :text="'Этот метод, названный именами его авторов, является усовершенствованием' +
                            ' метода экспоненциального сглаживания временного ряда. Экспоненциальное' +
                            ' сглаживание обеспечивает наглядное представление о тренде и позволяет' +
                            ' делать краткосрочные прогнозы. Более утонченный метод Хольта-Винтерса ' +
                            'успешно справляется и со среднесрочными, и с долгосрочными прогнозами,' +
                            ' поскольку он способен обнаруживать тренды, относящиеся к коротким периодам,' +
                            ' в моменты времени, непосредственно предшествующие прогнозным, и ' +
                            'экстраполировать эти тренды на будущее. И хотя возможна только линейная' +
                            ' экстраполяция в будущее, в большинстве реальных ситуаций ее оказывается' +
                            ' достаточно.'"/>
            </div>

            <div class="col-lg-6 col-md-12 mb-3">
                <card-method
                        :header="'Модель ARIMA'"
                        :header-color="'blue-gradient'"
                        :text="'ARIMA использует три основных параметра (p, d, q), которые выражаются' +
                        ' целыми числами. Вместе эти три параметра учитывают сезонность, тенденцию и' +
                        ' шум в наборах данных:\n' +
                        'p – порядок авторегрессии (AR), который позволяет добавить предыдущие значения' +
                        ' временного ряда;\n' +
                        'd – порядок интегрирования. Он добавляет в модель понятия разности временных' +
                        ' рядов;\n' +
                        'q – порядок скользящего среднего (MA), который позволяет установить погрешность' +
                        ' модели как линейную комбинацию наблюдавшихся ранее значе-ний ошибок.\n' +
                        'Для отслеживания сезонности используется сезонная модель ARIMA – ' +
                        'ARIMA(p,d,q)(P,D,Q)s. Здесь (p, d, q) – несезонные параметры, описанные выше,' +
                        ' а (P, D, Q) следуют тем же определениям, но применяются к сезонной' +
                        ' составляющей временного ряда. Параметр s определяет периодичность временного' +
                        ' ряда (4 — квартальные периоды, 12 – годовые периоды и т.д.).'"/>
            </div>
        </div>

    </div>
</template>

<script>
    import CardMethod from './CardMethod';
    import LinePng from './LinePng';

    export default {
        name: 'MethodsList',
        components: { CardMethod, LinePng },
        computed: {
            width() {
                return this.$store.getters.getWidth;
            }
        }
    }
</script>

<style>
@media (max-width: 576px) {
    h4 {
        font-size: 18px;
    }
    h3 {
        font-size: 22px;
    }
}
</style>