<template>
    <mdb-accordion :panes="accordion_data"/>
</template>

<script>
  import { mdbAccordion } from 'mdbvue';
  export default {
    components: {
      mdbAccordion,
    },
    props: [
        'freq_delivery',
        'size_order',
        'point_order',
        'reserve',
        'total_costs'
    ],
    computed: {
        accordion_data: function() {
            return [
                {
                    title: 'Фиксированный размер заказа:',
                    content: 'Фиксированный размер заказа равен ' + String(this.size_order) + ' ед. продукции. ' +
                        'Это оптимальный объём заказываемого товара, который позволяет минимизировать общие ' +
                        'издержки, связанные с заказом и хранением запасов.'
                },
                {
                    title: 'Точка заказа продукции:',
                    content:  'Точка заказа продукции равна ' + String(this.point_order) + ' ед. продукции' +
                        '. Точка заказа является таким уровнем складских остатков, когда должен быть размещен новый' +
                        ' заказ на поставку для пополнения запасов. Другими словами, это остаток на складе,' +
                        ' который является достаточным для обеспечения бесперебойного производства до того момента,' +
                        ' пока не проступит новая партия поставки.'
                },
                {
                    title: 'Резервный размер продукции:',
                    content: 'Резервный размер продукции равен ' + String(this.reserve) + ' ед. продукции. ' +
                        'Это специально созданный запас некоторого товара, предназначенный для покрытия возможной ' +
                        'недостаточности обычных запасов этого товара.'
                },
                {
                    title: 'Частота проверки остатков продукции:',
                    content: 'Частота проверки остатков продукции равна ' + String(this.freq_delivery) + ' дня. ' +
                            'Это интервал времени, через который необходимо проверять количество продукции на складе.'
                },
                {
                    title: 'Издержки предприятия:',
                    content: 'Издержки предприятия равны ' + String(this.total_costs) + ' руб. ' +
                            'Это затраты организации связанные с покупкой товара, его хранением и доставкой.'
                }
            ]
        }
    }
  }
</script>
